{
  "selectedTemplate": 1,
  "headings": {
    "skills": "Besondere Fähigkeiten",
    "awards": "",
    "education": "Ausbildung",
    "work": "Berufliche Erfahrung",
    "projects": "Projekte"
  },
  "basics": {
    "name": "Daniel Schleindlsperger",
    "address": "Max-Anderl-Str. 69, 85375 Neufahrn b. Freising",
    "birthday": "1993-08-23",
    "email": "daniel@schleindlsperger.de",
    "phone": "+49 152 56 11 57 86",
    "website": "https://daniel.schleindlsperger.de",
    "summary": "Als Software-Entwickler mit mehr als zwei Jahren Erfahrung im Konzipieren und Umsetzen von millionenfach besuchten und performance-kritischen Webseiten in agilen Teams bin ich auf der Suche nach eine XXX Umgebung, in der der Nutzer stets im Fokus steht."
  },
  "profiles": [
    {
      "name": "Github",
      "url": "https://github.com/danielschleindlsperger"
    },
    {
      "name": "Github",
      "url": "https://github.com/danielschleindlsperger"
    }
  ],
  "education": [
    {
      "institution": "Technische Hochschule Deggendorf",
      "location": "Deggendorf",
      "studyType": "BE",
      "endDate": "2017",
      "startDate": "2013",
      "area": "Medientechnik mit Schwerpunkt Medieninformatik"
    }
  ],
  "work": [
    {
      "website": "https://www.sz.de",
      "highlights": [
        "Mitverantwortung für die Seite SZ.de mit mehr als fünf Millionen Visits pro Tag",
        "Steigerung der Performance des wichtigsten Templates von SZ.de (Artikel) um mehr als 250% bei Relaunch als serverless React Applikation",
        "Verbesserte Integration der verteilten Kubernetes Microservices-Architektur in die lokale Entwicklungsumgebung durch internes CLI-Tool",
        "Verbesserung der Seiten-Performance und Verringerung des Wartungsaufwands von Frontend-Build-Konfigurationen durch generische Build-Library auf Basis von webpack",
        "Einführung von Features-Toggles und AB-Testing zur Steigerung der Agilität durch kontinuierliche Integration neuer Features in die Produktionsumgebung"
      ],
      "company": "Süddeutsche Zeitung Digitale Medien",
      "position": "Software-Entwickler",
      "startDate": "Juli 2018",
      "endDate": "heute"
    },
    {
      "highlights": [
        "Umsetzung einer Upselling-Lösung im Checkout",
        "Abschätzen der Parität von Browser-basiertem-Canvas- und server-seitigem PDF-Rendering durch Erstellen eines Prototyps in Vue.js und Laravel",
        "Anschließende Umsetzung einer Canvas-bassierten Web-Applikation zur Erstellugn von Fotobüchern in Vue.js",
        "Reduzierung der Komplexität eines jQuery-Monolithen durch schrittweises Refactoring"
      ],
      "company": "myposter",
      "position": "Webentwickler",
      "startDate": "01-2018",
      "endDate": "06-2018"
    },
    {
      "highlights": [
        ""
      ],
      "position": "Praktikant und Werkstudent Webenwicklung",
      "company": "coma AG",
      "startDate": "05-2016",
      "endDate": "2017-10"
    }
  ],
  "skills": [
    {
      "level": "",
      "keywords": [
        "Testing",
        "UIs mit React und Vue.js",
        "Serverless Technologien (AWS)",
        "Laravel und PHP",
        "Funktionales Programmieren in TypeScript, Scala und Clojure"
      ],
      "name": "Technologien"
    },
    {
      "keywords": [
        "Verständnis für alle Bereiche des Applikations-Stacks",
        "Scharfblick und schnelle Auffassungsgabe",
        "Hoher Wissensdurst"
      ],
      "name": "Grundsätzliches"
    }
  ],
  "projects": [
    {
      "name": " Autorenseiten",
      "keywords": [
        "React",
        "AWS Lambda",
        "AWS Cloudformation",
        "AWS DynamoDB",
        null
      ],
      "description": "Entstanden aus meiner Idee und prototypischen Umsetzung bei einem firmen-internen Hackathon setzt das Team eine eigenständige Seite als Spotlight für die Autoren der Süddeutschen Zeitung um.  Für den eigenständigen Microservice gilt es zunächst die Profile aller Autoren auszuwerten und veraltete Daten zu updaten. Durch Umsetzung als SSR-Applikation mit React gelingt eine Platzierung der meisten Autoren in den Top-Ergebnissen der Suchmaschinen sowie eine gute Nutzererfahrung durch schnelles Laden.  Für die Übersichtsseite aller Autoren wird eine 700 Einträge lange Liste von Autoren ohne Virtualisierung in einer React App performant dargestellt. Das Resultat zahlt ebenfalls auf eine erhöhte Auffindbarkeit bei Suchmaschinen und eine bessere UX ein.",
      "url": "https://sz.de/autoren"
    },
    {
      "keywords": [
        "React ",
        "AWS Cloudformation",
        "AWS S3",
        "AWS Cognito"
      ],
      "name": "Münchner Fenster Admin",
      "description": "Die interne Applikation erlaubt es Redakteuren Inhalte für das Fahrgast-TV in den Münchner U- und S-Bahnen zu pflegen. Der auf Cloudfront, S3 und Cognito basierende Stack ohne eigenem Code im Backend erlaubt es die Anwendung über Jahre hinweg sicher und kostengünstig ohne viel Wartungsaufwand zu betreiben."
    }
  ],
  "awards": [
    {
      "title": "",
      "date": "",
      "awarder": "",
      "summary": ""
    }
  ],
  "sections": [
    "templates",
    "profile",
    "education",
    "work",
    "skills",
    "projects",
    "awards"
  ]
}